app/Services/VooService.php

    public function listarOrigens()
    {
        return $this->vooModel
            ->select('origem')
            ->distinct()
            ->orderBy('origem')
            ->findAll();
---
SELECT DISTINCT `origem`
FROM `voos`
ORDER BY `origem`

    public function listarDestinos()
    {
        return $this->vooModel
            ->select('destino')
            ->distinct()
            ->orderBy('destino')
            ->findAll();
---
SELECT DISTINCT `destino`
FROM `voos`
ORDER BY `destino`

    public function listarDestinosPorOrigem($origem)
    {
        return $this->vooModel
            ->select('destino')
            ->where('origem', $origem)
            ->distinct()
            ->orderBy('destino')
            ->findAll();
---
SELECT DISTINCT `destino`
FROM `voos`
WHERE `origem` = 'Belo Horizonte (CNF)'
ORDER BY `destino`

    public function buscar(array $filtros)
    {
        $builder = $this->vooModel;

        if (!empty($filtros['origem'])) {
            $builder->where('origem', $filtros['origem']);
        }

        if (!empty($filtros['destino'])) {
            $builder->where('destino', $filtros['destino']);
        }

        if (!empty($filtros['data'])) {
            $builder->where("DATE(data_partida)", $filtros['data']);
        }

        if (!empty($filtros['companhia'])) {
            $builder->where('companhia', $filtros['companhia']);
        }

        return $builder
            ->orderBy('data_partida')
            ->findAll();
---
SELECT *
FROM `voos`
WHERE `origem` = 'Belo Horizonte (CNF)'
AND `destino` = 'Rio de Janeiro (SDU)'
AND DATE(data_partida) = '2026-08-11'
ORDER BY `data_partida`