app/Controllers/Dashboard.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
SELECT *
FROM `reservas`
WHERE `usuario_id` = '1'
---
    public function index()
    {

        $logado = session()->get('logado');

        if (!$logado) {
            die("Sessão não encontrada! O login não salvou o usuário. Volte e logue novamente.");
        }



        if (!session()->get('logado')) {
            return redirect()->to('/login');
        }

        $usuarioId = session()->get('usuario_id');

        // Busca os dados do usuário logado
        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->find($usuarioId);

        // Busca as reservas do usuário
        $reservaModel = new ReservaModel();
        $reservas = $reservaModel->where('usuario_id', $usuarioId)->findAll();