app/Controllers/Home.php

SELECT *
FROM `estados`
ORDER BY `nome` ASC
---
    public function index(): string
    {
        $estadoModel = new EstadoModel();
        $clienteModel = new ClientesModel();

        $data['estados'] = $estadoModel
            ->orderBy('nome', 'ASC')
            ->findAll();